logic-fault/ethernet-QEL/uC/PIC18/app_lib/TCPIP/Demo App/MainDemo.c
	#elif defined(__dsPIC33E__)||defined(__PIC24E__)

		// Crank up the core frequency
		PLLFBD = 38;				/* M  = 30	*/
		CLKDIVbits.PLLPOST = 0;		/* N1 = 2	*/
		CLKDIVbits.PLLPRE = 0;		/* N2 = 2	*/
		OSCTUN = 0;	
		
	    /*	Initiate Clock Switch to Primary
	     *	Oscillator with PLL (NOSC= 0x3)*/
	    __builtin_write_OSCCONH(0x03);		
		__builtin_write_OSCCONL(0x01);
		// Disable Watch Dog Timer
	    RCONbits.SWDTEN = 0;
		while (OSCCONbits.COSC != 0x3); 
		while (_LOCK == 0);			/* Wait for PLL lock at 60 MIPS */		
		// Port I/O
		ANSELAbits.ANSA7 = 0 ;   //Make RA7 (BUTTON1) a digital input
		#if defined ENC100_INTERFACE_MODE > 0
			ANSELEbits.ANSE0 = 0;      // Make these PMP pins as digital output when the interface is parallel.
			ANSELEbits.ANSE1 = 0;
			ANSELEbits.ANSE2 = 0;
			ANSELEbits.ANSE3 = 0;	
			ANSELEbits.ANSE4 = 0;
			ANSELEbits.ANSE5 = 0;
			ANSELEbits.ANSE6 = 0;
			ANSELEbits.ANSE7 = 0;	
			ANSELBbits.ANSB10 = 0;
			ANSELBbits.ANSB11 = 0;
			ANSELBbits.ANSB12 = 0;
			ANSELBbits.ANSB13 = 0;
			ANSELBbits.ANSB15 = 0;
		#endif

		ANSELEbits.ANSE8= 0 ;    // Make RE8(INT1) a digital input for ZeroG ZG2100M PICtail 
					
		AD1CHS0 = 0;		     // Input to AN0 (potentiometer)
		ANSELBbits.ANSB0= 1;     // Input to AN0 (potentiometer)
		ANSELBbits.ANSB5= 1;     // Disable digital input on AN5 (potentiometer)
		ANSELBbits.ANSB4= 1;     // Disable digital input on AN4 (TC1047A temp sensor)
					
		ANSELDbits.ANSD7 =0;     //  Digital Pin Selection for S3(Pin 83) and S4(pin 84).
		ANSELDbits.ANSD6 =0;
			
		ANSELGbits.ANSG6 =0;     // Enable Digital input for RG6 (SCK2)
		ANSELGbits.ANSG7 =0;     // Enable Digital input for RG7 (SDI2)
		ANSELGbits.ANSG8 =0;     // Enable Digital input for RG8 (SDO2)
		ANSELGbits.ANSG9 =0;     // Enable Digital input for RG9 (CS)
				
		#if defined ENC100_INTERFACE_MODE == 0	// SPI Interface, UART can be used for debugging. Not allowed for other interfaces.
			RPOR9 = 0x0300;          //RP101= U2TX
			RPINR19 = 0X0064;  		 //RP100= U2RX
		#endif

		#if defined WF_CS_TRIS
			RPINR1bits.INT3R = 30;
			WF_CS_IO = 1;
			WF_CS_TRIS = 0;		

		#endif

	#else	//defined(__PIC24F__) || defined(__PIC32MX__)
		#if defined(__PIC24F__)
			CLKDIVbits.RCDIV = 0;		// Set 1:1 8MHz FRC postscalar
		#endif
		
		// ADC
	    #if defined(__PIC24FJ256DA210__) || defined(__PIC24FJ256GB210__)
	    	// Disable analog on all pins
	    	ANSA = 0x0000;
	    	ANSB = 0x0000;
	    	ANSC = 0x0000;
	    	ANSD = 0x0000;
	    	ANSE = 0x0000;
	    	ANSF = 0x0000;
	    	ANSG = 0x0000;
		#else
		    AD1CHS = 0;					// Input to AN0 (potentiometer)
			AD1PCFGbits.PCFG4 = 0;		// Disable digital input on AN4 (TC1047A temp sensor)
			#if defined(__32MX460F512L__) || defined(__32MX795F512L__)	// PIC32MX460F512L and PIC32MX795F512L PIMs has different pinout to accomodate USB module
				AD1PCFGbits.PCFG2 = 0;		// Disable digital input on AN2 (potentiometer)
			#else
				AD1PCFGbits.PCFG5 = 0;		// Disable digital input on AN5 (potentiometer)
			#endif
		#endif
	#endif

	// ADC
	AD1CON1 = 0x84E4;			// Turn on, auto sample start, auto-convert, 12 bit mode (on parts with a 12bit A/D)
	AD1CON2 = 0x0404;			// AVdd, AVss, int every 2 conversions, MUXA only, scan
	AD1CON3 = 0x1003;			// 16 Tad auto-sample, Tad = 3*Tcy
	#if defined(__32MX460F512L__) || defined(__32MX795F512L__)	// PIC32MX460F512L and PIC32MX795F512L PIMs has different pinout to accomodate USB module
		AD1CSSL = 1<<2;				// Scan pot
	#else
		AD1CSSL = 1<<5;				// Scan pot
	#endif

	// UART
	#if defined(STACK_USE_UART)

		#if defined(__PIC24E__) || defined(__dsPIC33E__)
			#if defined (ENC_CS_IO) || defined (WF_CS_IO)   // UART to be used in case of ENC28J60 or MRF24W
				__builtin_write_OSCCONL(OSCCON & 0xbf);
				RPOR9bits.RP101R = 3; //Map U2TX to RF5
				RPINR19bits.U2RXR = 0;
				RPINR19bits.U2RXR = 0x64; //Map U2RX to RF4
				__builtin_write_OSCCONL(OSCCON | 0x40);
			#endif
			#if(ENC100_INTERFACE_MODE == 0)                 // UART to be used only in case of SPI interface with ENC624Jxxx
					__builtin_write_OSCCONL(OSCCON & 0xbf);
				RPOR9bits.RP101R = 3; //Map U2TX to RF5
				RPINR19bits.U2RXR = 0;
				RPINR19bits.U2RXR = 0x64; //Map U2RX to RF4
				__builtin_write_OSCCONL(OSCCON | 0x40);

			#endif
		#endif

		UARTTX_TRIS = 0;
		UARTRX_TRIS = 1;
		UMODE = 0x8000;			// Set UARTEN.  Note: this must be done before setting UTXEN

		#if defined(__C30__)
			USTA = 0x0400;		// UTXEN set
			#define CLOSEST_UBRG_VALUE ((GetPeripheralClock()+8ul*BAUD_RATE)/16/BAUD_RATE-1)
			#define BAUD_ACTUAL (GetPeripheralClock()/16/(CLOSEST_UBRG_VALUE+1))
		#else	//defined(__C32__)
			USTA = 0x00001400;		// RXEN set, TXEN set
			#define CLOSEST_UBRG_VALUE ((GetPeripheralClock()+8ul*BAUD_RATE)/16/BAUD_RATE-1)
			#define BAUD_ACTUAL (GetPeripheralClock()/16/(CLOSEST_UBRG_VALUE+1))
		#endif
	
		#define BAUD_ERROR ((BAUD_ACTUAL > BAUD_RATE) ? BAUD_ACTUAL-BAUD_RATE : BAUD_RATE-BAUD_ACTUAL)
		#define BAUD_ERROR_PRECENT	((BAUD_ERROR*100+BAUD_RATE/2)/BAUD_RATE)
		#if (BAUD_ERROR_PRECENT > 3)
			#warning UART frequency error is worse than 3%
		#elif (BAUD_ERROR_PRECENT > 2)
			#warning UART frequency error is worse than 2%
		#endif
	
		UBRG = CLOSEST_UBRG_VALUE;
	#endif

#endif

// Deassert all chip select lines so there isn't any problem with 
// initialization order.  Ex: When ENC28J60 is on SPI2 with Explorer 16, 
// MAX3232 ROUT2 pin will drive RF12/U2CTS ENC28J60 CS line asserted, 
// preventing proper 25LC256 EEPROM operation.
#if defined(ENC_CS_TRIS)
	ENC_CS_IO = 1;
	ENC_CS_TRIS = 0;
#endif
#if defined(ENC100_CS_TRIS)
	ENC100_CS_IO = (ENC100_INTERFACE_MODE == 0);
	ENC100_CS_TRIS = 0;
#endif
#if defined(EEPROM_CS_TRIS)
	EEPROM_CS_IO = 1;
	EEPROM_CS_TRIS = 0;
#endif
#if defined(SPIRAM_CS_TRIS)
	SPIRAM_CS_IO = 1;
	SPIRAM_CS_TRIS = 0;
#endif
#if defined(SPIFLASH_CS_TRIS)
	SPIFLASH_CS_IO = 1;
	SPIFLASH_CS_TRIS = 0;
#endif
#if defined(WF_CS_TRIS)
	WF_CS_IO = 1;
	WF_CS_TRIS = 0;
#endif

#if defined(PIC24FJ64GA004_PIM)
	__builtin_write_OSCCONL(OSCCON & 0xBF);  // Unlock PPS

	// Remove some LED outputs to regain other functions
	LED1_TRIS = 1;		// Multiplexed with BUTTON0
	LED5_TRIS = 1;		// Multiplexed with EEPROM CS
	LED7_TRIS = 1;		// Multiplexed with BUTTON1
	
	// Inputs
	RPINR19bits.U2RXR = 19;			//U2RX = RP19
	RPINR22bits.SDI2R = 20;			//SDI2 = RP20
	RPINR20bits.SDI1R = 17;			//SDI1 = RP17
	
	// Outputs
	RPOR12bits.RP25R = U2TX_IO;		//RP25 = U2TX  
	RPOR12bits.RP24R = SCK2OUT_IO; 	//RP24 = SCK2
	RPOR10bits.RP21R = SDO2_IO;		//RP21 = SDO2
	RPOR7bits.RP15R = SCK1OUT_IO; 	//RP15 = SCK1
	RPOR8bits.RP16R = SDO1_IO;		//RP16 = SDO1
	
